[
  {
    "id": "carti",
    "type": "video",
    "title": "Carti Project",
    "description": "This is a project I made shortly after the relase of the highly anticipated 'MUSIC' by Playboi Carti. It is a lyric video for his track 'Olympian'. I merged multiple of his pre-existing music videos to form a base and then went off working on the typography.",
    "videoSrc": "assets/carticompressed.mp4",
    "thumbnail": "carti1.webp",
    "x": 50,
    "y": 23,
    "z": 50,
    "width": 30,
    "height": 20,
    "depth": 30,
    "media": [
      { "type": "video", "src": "https://vimeo.com/1128965040" }
    ]
  },
  {
    "id": "asfalt",
    "type": "image",
    "title": "Asfalt Texture",
    "description": "Asfalt was my final project in my second year of studies. The brief was intentionally vague, giving us complete freedom in both concept and execution, with the only requirement being to produce a typographic specimen in a physical format. At the time, I was deeply inspired by anti-design and fascinated by super condensed and stretched fonts. During my research, I came across a typeface that immediately captivated me. The typeface, originally drawn by Dinamo Type, was based on road markings, which appear stretched when viewed from above since they are designed for drivers’ perspectives. This concept perfectly aligned with my vision, and the fact that it was a variable typeface gave me even more creative freedom. Building on the theme of roads, I created a four-meter-long leporello exploring the history of racism and highways in the United States, beginning with the conception of the highway system at the 1939 New York World’s Fair. The construction of these highways often destroyed Black and brown communities, displacing countless families. Throughout the specimen, I discussed both the architects of this racist infrastructure and the people who resisted it, using typography as a vehicle to “drive” through this history. The visuals drew from highway signage and the protest signs used during marches against these destructive urban projects, merging the aesthetics of control and resistance into one continuous visual journey."
    "thumbnail": "asfalt.webp",
    "x": -50,
    "y": 35,
    "z": 90,
    "width": 15,
    "height": 50,
    "media": [
      { "type": "img", "src": "assets/asfalt/asfaltmockup.webp" },
      { "type": "img", "src": "assets/asfalt/AsfaltFront8.webp" },
      { "type": "img", "src": "assets/asfalt/asfaltmockup2.webp" },
      { "type": "img", "src": "assets/asfalt/AsfaltFront3.webp" },
      { "type": "img", "src": "assets/asfalt/AsfaltFront4.webp" },
      { "type": "img", "src": "assets/asfalt/AsfaltFront5.webp" },
      { "type": "img", "src": "assets/asfalt/asfaltmockup3.webp" },
      { "type": "img", "src": "assets/asfalt/AsfaltFront10.webp" },
      { "type": "img", "src": "assets/asfalt/AsfaltFront21.webp" }
    ]
  },
  {
    "id": "frank",
    "type": "image",
    "title": "Frank Texture",
    "description": "A-OK was my vision for what a new Frank Ocean album could resemble. I deliberately based my visuals off the editorial work and the jewlery work he has done at HOMER rather than basing it off his older artistic direction. His older direction was far more tame than what he works with today which is far more experimental. Even looking just at the Blonde vinyl rerelase one can see that his art direction has had a big shift",
    "thumbnail": "frank.webp",
    "x": 30,
    "y": 22,
    "z": 150,
    "width": 30,
    "height": 30,
    "media": [
      { "type": "img", "src": "assets/AOK/frank.webp" },
      { "type": "img", "src": "assets/AOK/Frank76.webp" },
      { "type": "img", "src": "assets/AOK/Frank74.webp" },
      { "type": "img", "src": "assets/AOK/Frank75.webp" },
      { "type": "img", "src": "assets/AOK/Frank72.webp" },
      { "type": "img", "src": "assets/AOK/Frank73.webp" }
    ]
  },
  {
    "id": "hollis",
    "type": "video",
    "title": "Hollis Project",
    "description": "This was a lyric video I made for the song 'Light' by 2Hollis. In this one my main goal was really to experiment with creating texture from videos as I hadn't tried it out too much. I ended up mixing that with a more anti-design style of putting my text as well as some audio-reactvie visuals as well.",
    "videoSrc": "assets/holliscompressed.mp4",
    "thumbnail": "hollis1.webp",
    "x": -70,
    "y": 25,
    "z": 200,
    "width": 30,
    "height": 30,
    "depth": 30,
    "media": [
      { "type": "video", "src": "https://vimeo.com/1128965421" }
    ]
  },
  {
    "id": "wizardofoz",
    "type": "image",
    "title": "Wizard of Oz",
    "description": "A studio shoot where the concept was to mix the 'Wizard of Oz' with modern fashion. I really wanted to play with this very 'windows xp' sort of aesthetic using super green grass and a bright blue sky. I designed the entire set as well as all the costumes.",
    "thumbnail": "wizardofoz.webp",
    "x": 0,
    "y": 23,
    "z": 230,
    "width": 30,
    "height": 20,
    "media": [
      { "type": "img", "src": "assets/wizard/woz1.webp" },
      { "type": "img", "src": "assets/wizard/woz2.webp" },
      { "type": "img", "src": "assets/wizard/woz3.webp" },
      { "type": "img", "src": "assets/wizard/woz5.webp" },
      { "type": "img", "src": "assets/wizard/woz6.webp" },
      { "type": "img", "src": "assets/wizard/woz7.webp" },
      { "type": "img", "src": "assets/wizard/woz9.webp" }
    ]
  },
  {
    "id": "HUGO",
    "type": "image",
    "title": "HUGO",
    "description": "*Hugo* was an editorial project I worked on with three colleagues, where my main role was focused on the book’s editorial design. The brief required us to integrate AI in some way, and we chose to have it generate text rather than images. We invented a fictional person named Hugo, fed the AI fragments of information one might find online, and asked it to recreate his thoughts and life story. As the book progresses, the text shifts from surface-level facts to deeply personal details, questioning how well AI can know a person. Printed on transparent plastic, each page layers over the last, visually mirroring the accumulation of data. The typography evolves from clean sans serifs to chaotic, distorted scripts, symbolizing the unraveling of Hugo’s identity until the final reveal that everything about him was pieced together solely from public information."
    "thumbnail": "hugo.gif",
    "x": 26,
    "y": 28,
    "z": 290,
    "width": 30,
    "height": 20,
    "media": [
      { "type": "img", "src": "assets/HUGO/HUGO1.webp" },
      { "type": "img", "src": "assets/HUGO/HUGO2.webp" },
      { "type": "img", "src": "assets/HUGO/HUGO3.webp" },
      { "type": "img", "src": "assets/HUGO/HUGO6.webp" },
      { "type": "img", "src": "assets/HUGO/HUGO4.webp" },
      { "type": "img", "src": "assets/HUGO/HUGO5.webp" },
      { "type": "img", "src": "assets/HUGO/hugo.gif" }
    ]
  },
  {
    "id": "kendrick",
    "type": "video",
    "title": "Kendrick Project",
    "description": "Another video I made right after Kendrick Lamar released 'Meet the Grahams'. My main goal with this one was to play around with rotoscoping and really understand how it worked. Along with this I also learned how to 3d track scenes to place my text inside of them so it was a major learning experience for me.",
    "videoSrc": "assets/kendrickcompressed.mp4",
    "thumbnail": "kendrick1.webp",
    "x": -60,
    "y": 23,
    "z": 350,
    "width": 30,
    "height": 30,
    "depth": 30,
    "media": [
      { "type": "video", "src": "https://vimeo.com/1128965801" }
    ]
  }
]
